#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

OpenTofu
konnect_portal.default_portal: Preparing import... [id=2698b8cd-3ade-4faa-8524-ad798ea3e2f0]
konnect_portal.default_portal: Refreshing state... [id=2698b8cd-3ade-4faa-8524-ad798ea3e2f0]
module.networks["dev_au"].data.konnect_cloud_gateway_provider_account_list.my_cloudgatewayprovideraccountlist: Reading...
module.networks["dev_au"].data.konnect_cloud_gateway_provider_account_list.my_cloudgatewayprovideraccountlist: Read complete after 0s

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # konnect_portal.default_portal will be updated in-place
  # (imported from "2698b8cd-3ade-4faa-8524-ad798ea3e2f0")
  ~ resource "konnect_portal" "default_portal" {
      ~ application_count                    = 1 -> (known after apply)
        auto_approve_applications            = false
        auto_approve_developers              = false
      ~ created_at                           = "2023-11-02T22:32:07.293Z" -> (known after apply)
      + custom_client_domain                 = (known after apply)
        custom_domain                        = "portal.fomm.au"
      ~ default_application_auth_strategy_id = "5f809ff5-31e0-48b4-a7f4-85fcd4812b32" -> (known after apply)
      ~ default_domain                       = "5c9bf942eab4.au.portal.konghq.com" -> (known after apply)
      + description                          = (known after apply)
      ~ developer_count                      = 1 -> (known after apply)
      ~ display_name                         = "Developer Portal" -> (known after apply)
      + force                                = "false"
      ~ id                                   = "2698b8cd-3ade-4faa-8524-ad798ea3e2f0" -> (known after apply)
        is_public                            = false
      + labels                               = (known after apply)
        name                                 = "foMM Default Dev Portal"
      ~ published_product_count              = 2 -> (known after apply)
        rbac_enabled                         = false
      ~ updated_at                           = "2024-07-25T03:12:48.266Z" -> (known after apply)
    }

  # module.control-planes.konnect_gateway_control_plane.cps["demo"] will be created
  + resource "konnect_gateway_control_plane" "cps" {
      + auth_type     = "pki_client_certs"
      + cloud_gateway = false
      + cluster_type  = "CLUSTER_TYPE_CONTROL_PLANE"
      + config        = (known after apply)
      + description   = "Control plane used by dev team"
      + id            = (known after apply)
      + labels        = {
          + "environment" = "demo"
          + "provisioner" = "terraform"
          + "team"        = "devops"
        }
      + name          = "demo"
    }

  # module.control-planes.konnect_gateway_control_plane.cps["dev_au_cloud"] will be created
  + resource "konnect_gateway_control_plane" "cps" {
      + auth_type     = "pinned_client_certs"
      + cloud_gateway = true
      + cluster_type  = "CLUSTER_TYPE_CONTROL_PLANE"
      + config        = (known after apply)
      + description   = "Control plane in AU used by cloud devops team"
      + id            = (known after apply)
      + labels        = {
          + "environment" = "cloud"
          + "provisioner" = "terraform"
          + "region"      = "au"
          + "team"        = "devops"
        }
      + name          = "dev-au-cloud"
    }

  # module.control-planes.konnect_gateway_control_plane.cps["home_cluster"] will be created
  + resource "konnect_gateway_control_plane" "cps" {
      + auth_type     = "pki_client_certs"
      + cloud_gateway = false
      + cluster_type  = "CLUSTER_TYPE_K8S_INGRESS_CONTROLLER"
      + config        = (known after apply)
      + description   = "KIC running on homelabe cluster"
      + id            = (known after apply)
      + labels        = {
          + "provisioner" = "terraform"
        }
      + name          = "home-cluster"
    }

  # module.control-planes.konnect_gateway_control_plane.cps["staging"] will be created
  + resource "konnect_gateway_control_plane" "cps" {
      + auth_type     = "pki_client_certs"
      + cloud_gateway = false
      + cluster_type  = "CLUSTER_TYPE_CONTROL_PLANE"
      + config        = (known after apply)
      + id            = (known after apply)
      + labels        = {
          + "provisioner" = "terraform"
        }
      + name          = "staging"
    }

  # module.control-planes.konnect_gateway_data_plane_client_certificate.fomm_rsa_root_ca["demo"] will be created
  + resource "konnect_gateway_data_plane_client_certificate" "fomm_rsa_root_ca" {
      + cert             = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIF6zCCA9OgAwIBAgIUHQlIjxxhwJEpa+bpHMbGcrJdh2UwDQYJKoZIhvcNAQEL
            BQAwfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3RvcmlhMRIwEAYDVQQHDAlN
            ZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYDVQQLDBBmb01NIFJTQSBS
            b290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENBMB4XDTIxMDcwNzExMDkx
            MVoXDTQxMDcwMjExMDkxMVowfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3Rv
            cmlhMRIwEAYDVQQHDAlNZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYD
            VQQLDBBmb01NIFJTQSBSb290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENB
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAx0W8j/3/ErEbR4leh4dv
            qEloKxx8aFo3RoETS5AWtSN+f0NjWZDw9o+5ipmd/IaHNOXLPDCUSWZYl7rjT88m
            eUmQvsO7C7tjiBRERFiJHMmoFwY99g8TADR58mTvVOw58PrgWBtMLYSLa4D2bwt0
            X4ZQi0t6NE2LdUF1Ts0iKkjNSoTzcwBTX3RgYnMfSn3VHatu9qre/Xy2Yl7erGzo
            h+Y3mQpEa1/vIA9X+j/wX5tBkJ6RxEvCffNOjd1wG3s0U8VPyRcUiTuKqSh+smtq
            xeQNUhUAfigh0O8X6iGx5l/2Un6EzsJ27ScY4ynYx51W1lSwwr7/GObm57Bivpvn
            1n6YoMQ23Afsx/NDxUsBnKt7FxXzQwNwqluqj/+PNykIYvdPJsjqYxNrQUzKUy/Y
            VqiNhL2K3uxYGTg1dCl7fk9tXqj3Kpu/upqVdSRBg1Ej9L+U/zoSPj1JWzMNp/Gt
            T2xUZ1lNm3aNQiNvRMl95JAalsaGhVGIqemGy0oJqKcSuuUfe7rChOkWr09g3e7V
            psQZnV9sWYseLrFxwoxPlSYBg19Wd5xCVnNht+RgjpP6Q29rax6xkVvxw4LKc1Ce
            56T+Py5IIBZ71l/8zpKOWov2C97dV/kVtJ8+LpbVJ6p7C82wShO1y8wGv9+KU5xf
            Ldajk5D4TE8apDYXlHGrfnUCAwEAAaNjMGEwHQYDVR0OBBYEFECo5LRGmunPA5pB
            qwJq5inA6OUUMB8GA1UdIwQYMBaAFECo5LRGmunPA5pBqwJq5inA6OUUMA8GA1Ud
            EwEB/wQFMAMBAf8wDgYDVR0PAQH/BAQDAgGGMA0GCSqGSIb3DQEBCwUAA4ICAQC3
            cD5tOqlF1ZjzjYfpK17lTO3SiBHQQmW+oH3UNUCFsut/s6rzxnc0bpIB6OT0Pn3s
            xQWTwEMdFAvfhIzj+zeLRVP6WsidppikRmoKLjZjru4E6YlWA9Tdcgs2abrB824c
            0iRl291AcrZYpFEWL7k8r3Lr9yXIlvHUhjEgn5ShDbd7/F/68QTxU5CtqE0z9Go+
            3BM+8LUYvQsUaEnGUsNAR2BcSLwkXi0+IpKXztyRHhn+hOHOIW3/4FbCCJDtVjst
            xHVF7EwxqjmNboIdqnBlsLle/tIcApuh/VapZpj+3AdHdCMHDPGSpvryia+fZI0S
            Tv3sDOaW918rhki0ARoMOBMKPmu1UigFQ3NrocPV6/Fk7M9uYgyTFSVN9kvRxAbJ
            oMp2rMKVjxhxd1K70jPwzbnXnGr83s9cFbbDZb1tPflpqJy5gHlDIGkY0Gc+W3yL
            h+fVgQYZ+ZfUhc7S156NvWWYy3FV+ZaGqySef2XAVKtkzNXWON5pao/FxGytlnck
            OynrqUkMeZInb11+A5P4NhgFUHjFfnyGaVwquoAMl78757iYAju/aVr3Rg5+695B
            wmqmEmjkZ4nKrQRMOiHdCXc1+I188IM1uPXPqdFT7kaZeTJEMkBQ2wy4Qpi95Tlw
            WYmHySjRqWVdgwZ64yXHgOglBmgNk76g4VNmZ9Z36Q==
            -----END CERTIFICATE-----
        EOT
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.control-planes.konnect_gateway_data_plane_client_certificate.fomm_rsa_root_ca["home_cluster"] will be created
  + resource "konnect_gateway_data_plane_client_certificate" "fomm_rsa_root_ca" {
      + cert             = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIF6zCCA9OgAwIBAgIUHQlIjxxhwJEpa+bpHMbGcrJdh2UwDQYJKoZIhvcNAQEL
            BQAwfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3RvcmlhMRIwEAYDVQQHDAlN
            ZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYDVQQLDBBmb01NIFJTQSBS
            b290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENBMB4XDTIxMDcwNzExMDkx
            MVoXDTQxMDcwMjExMDkxMVowfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3Rv
            cmlhMRIwEAYDVQQHDAlNZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYD
            VQQLDBBmb01NIFJTQSBSb290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENB
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAx0W8j/3/ErEbR4leh4dv
            qEloKxx8aFo3RoETS5AWtSN+f0NjWZDw9o+5ipmd/IaHNOXLPDCUSWZYl7rjT88m
            eUmQvsO7C7tjiBRERFiJHMmoFwY99g8TADR58mTvVOw58PrgWBtMLYSLa4D2bwt0
            X4ZQi0t6NE2LdUF1Ts0iKkjNSoTzcwBTX3RgYnMfSn3VHatu9qre/Xy2Yl7erGzo
            h+Y3mQpEa1/vIA9X+j/wX5tBkJ6RxEvCffNOjd1wG3s0U8VPyRcUiTuKqSh+smtq
            xeQNUhUAfigh0O8X6iGx5l/2Un6EzsJ27ScY4ynYx51W1lSwwr7/GObm57Bivpvn
            1n6YoMQ23Afsx/NDxUsBnKt7FxXzQwNwqluqj/+PNykIYvdPJsjqYxNrQUzKUy/Y
            VqiNhL2K3uxYGTg1dCl7fk9tXqj3Kpu/upqVdSRBg1Ej9L+U/zoSPj1JWzMNp/Gt
            T2xUZ1lNm3aNQiNvRMl95JAalsaGhVGIqemGy0oJqKcSuuUfe7rChOkWr09g3e7V
            psQZnV9sWYseLrFxwoxPlSYBg19Wd5xCVnNht+RgjpP6Q29rax6xkVvxw4LKc1Ce
            56T+Py5IIBZ71l/8zpKOWov2C97dV/kVtJ8+LpbVJ6p7C82wShO1y8wGv9+KU5xf
            Ldajk5D4TE8apDYXlHGrfnUCAwEAAaNjMGEwHQYDVR0OBBYEFECo5LRGmunPA5pB
            qwJq5inA6OUUMB8GA1UdIwQYMBaAFECo5LRGmunPA5pBqwJq5inA6OUUMA8GA1Ud
            EwEB/wQFMAMBAf8wDgYDVR0PAQH/BAQDAgGGMA0GCSqGSIb3DQEBCwUAA4ICAQC3
            cD5tOqlF1ZjzjYfpK17lTO3SiBHQQmW+oH3UNUCFsut/s6rzxnc0bpIB6OT0Pn3s
            xQWTwEMdFAvfhIzj+zeLRVP6WsidppikRmoKLjZjru4E6YlWA9Tdcgs2abrB824c
            0iRl291AcrZYpFEWL7k8r3Lr9yXIlvHUhjEgn5ShDbd7/F/68QTxU5CtqE0z9Go+
            3BM+8LUYvQsUaEnGUsNAR2BcSLwkXi0+IpKXztyRHhn+hOHOIW3/4FbCCJDtVjst
            xHVF7EwxqjmNboIdqnBlsLle/tIcApuh/VapZpj+3AdHdCMHDPGSpvryia+fZI0S
            Tv3sDOaW918rhki0ARoMOBMKPmu1UigFQ3NrocPV6/Fk7M9uYgyTFSVN9kvRxAbJ
            oMp2rMKVjxhxd1K70jPwzbnXnGr83s9cFbbDZb1tPflpqJy5gHlDIGkY0Gc+W3yL
            h+fVgQYZ+ZfUhc7S156NvWWYy3FV+ZaGqySef2XAVKtkzNXWON5pao/FxGytlnck
            OynrqUkMeZInb11+A5P4NhgFUHjFfnyGaVwquoAMl78757iYAju/aVr3Rg5+695B
            wmqmEmjkZ4nKrQRMOiHdCXc1+I188IM1uPXPqdFT7kaZeTJEMkBQ2wy4Qpi95Tlw
            WYmHySjRqWVdgwZ64yXHgOglBmgNk76g4VNmZ9Z36Q==
            -----END CERTIFICATE-----
        EOT
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.control-planes.konnect_gateway_data_plane_client_certificate.fomm_rsa_root_ca["staging"] will be created
  + resource "konnect_gateway_data_plane_client_certificate" "fomm_rsa_root_ca" {
      + cert             = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIF6zCCA9OgAwIBAgIUHQlIjxxhwJEpa+bpHMbGcrJdh2UwDQYJKoZIhvcNAQEL
            BQAwfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3RvcmlhMRIwEAYDVQQHDAlN
            ZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYDVQQLDBBmb01NIFJTQSBS
            b290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENBMB4XDTIxMDcwNzExMDkx
            MVoXDTQxMDcwMjExMDkxMVowfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3Rv
            cmlhMRIwEAYDVQQHDAlNZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYD
            VQQLDBBmb01NIFJTQSBSb290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENB
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAx0W8j/3/ErEbR4leh4dv
            qEloKxx8aFo3RoETS5AWtSN+f0NjWZDw9o+5ipmd/IaHNOXLPDCUSWZYl7rjT88m
            eUmQvsO7C7tjiBRERFiJHMmoFwY99g8TADR58mTvVOw58PrgWBtMLYSLa4D2bwt0
            X4ZQi0t6NE2LdUF1Ts0iKkjNSoTzcwBTX3RgYnMfSn3VHatu9qre/Xy2Yl7erGzo
            h+Y3mQpEa1/vIA9X+j/wX5tBkJ6RxEvCffNOjd1wG3s0U8VPyRcUiTuKqSh+smtq
            xeQNUhUAfigh0O8X6iGx5l/2Un6EzsJ27ScY4ynYx51W1lSwwr7/GObm57Bivpvn
            1n6YoMQ23Afsx/NDxUsBnKt7FxXzQwNwqluqj/+PNykIYvdPJsjqYxNrQUzKUy/Y
            VqiNhL2K3uxYGTg1dCl7fk9tXqj3Kpu/upqVdSRBg1Ej9L+U/zoSPj1JWzMNp/Gt
            T2xUZ1lNm3aNQiNvRMl95JAalsaGhVGIqemGy0oJqKcSuuUfe7rChOkWr09g3e7V
            psQZnV9sWYseLrFxwoxPlSYBg19Wd5xCVnNht+RgjpP6Q29rax6xkVvxw4LKc1Ce
            56T+Py5IIBZ71l/8zpKOWov2C97dV/kVtJ8+LpbVJ6p7C82wShO1y8wGv9+KU5xf
            Ldajk5D4TE8apDYXlHGrfnUCAwEAAaNjMGEwHQYDVR0OBBYEFECo5LRGmunPA5pB
            qwJq5inA6OUUMB8GA1UdIwQYMBaAFECo5LRGmunPA5pBqwJq5inA6OUUMA8GA1Ud
            EwEB/wQFMAMBAf8wDgYDVR0PAQH/BAQDAgGGMA0GCSqGSIb3DQEBCwUAA4ICAQC3
            cD5tOqlF1ZjzjYfpK17lTO3SiBHQQmW+oH3UNUCFsut/s6rzxnc0bpIB6OT0Pn3s
            xQWTwEMdFAvfhIzj+zeLRVP6WsidppikRmoKLjZjru4E6YlWA9Tdcgs2abrB824c
            0iRl291AcrZYpFEWL7k8r3Lr9yXIlvHUhjEgn5ShDbd7/F/68QTxU5CtqE0z9Go+
            3BM+8LUYvQsUaEnGUsNAR2BcSLwkXi0+IpKXztyRHhn+hOHOIW3/4FbCCJDtVjst
            xHVF7EwxqjmNboIdqnBlsLle/tIcApuh/VapZpj+3AdHdCMHDPGSpvryia+fZI0S
            Tv3sDOaW918rhki0ARoMOBMKPmu1UigFQ3NrocPV6/Fk7M9uYgyTFSVN9kvRxAbJ
            oMp2rMKVjxhxd1K70jPwzbnXnGr83s9cFbbDZb1tPflpqJy5gHlDIGkY0Gc+W3yL
            h+fVgQYZ+ZfUhc7S156NvWWYy3FV+ZaGqySef2XAVKtkzNXWON5pao/FxGytlnck
            OynrqUkMeZInb11+A5P4NhgFUHjFfnyGaVwquoAMl78757iYAju/aVr3Rg5+695B
            wmqmEmjkZ4nKrQRMOiHdCXc1+I188IM1uPXPqdFT7kaZeTJEMkBQ2wy4Qpi95Tlw
            WYmHySjRqWVdgwZ64yXHgOglBmgNk76g4VNmZ9Z36Q==
            -----END CERTIFICATE-----
        EOT
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.control-planes.konnect_mesh_control_plane.tf_global_cp will be created
  + resource "konnect_mesh_control_plane" "tf_global_cp" {
      + created_at  = (known after apply)
      + description = "This is the mesh control plane created by terraform"
      + id          = (known after apply)
      + labels      = {
          + "provisioner" = "terraform"
        }
      + name        = "tf-global-cp"
      + updated_at  = (known after apply)
    }

  # module.default-dev-portal.konnect_api_product.echo will be created
  + resource "konnect_api_product" "echo" {
      + created_at    = (known after apply)
      + description   = "This is a description for my API Product"
      + id            = (known after apply)
      + labels        = (known after apply)
      + name          = "tf-echo"
      + portal_ids    = [
          + (known after apply),
        ]
      + portals       = (known after apply)
      + updated_at    = (known after apply)
      + version_count = (known after apply)
    }

  # module.default-dev-portal.konnect_api_product.httpbin will be created
  + resource "konnect_api_product" "httpbin" {
      + created_at    = (known after apply)
      + description   = "This is a description for my API Product"
      + id            = (known after apply)
      + labels        = (known after apply)
      + name          = "tf-httpbin"
      + portal_ids    = [
          + (known after apply),
        ]
      + portals       = (known after apply)
      + updated_at    = (known after apply)
      + version_count = (known after apply)
    }

  # module.default-dev-portal.konnect_api_product_version.echo_v1 will be created
  + resource "konnect_api_product_version" "echo_v1" {
      + api_product_id  = (known after apply)
      + created_at      = (known after apply)
      + deprecated      = (known after apply)
      + gateway_service = {
          + control_plane_id = (known after apply)
          + id               = (known after apply)
          + runtime_group_id = (known after apply)
        }
      + id              = (known after apply)
      + name            = "v1"
      + portals         = (known after apply)
      + updated_at      = (known after apply)
    }

  # module.default-dev-portal.konnect_api_product_version.httpbin_v1 will be created
  + resource "konnect_api_product_version" "httpbin_v1" {
      + api_product_id  = (known after apply)
      + created_at      = (known after apply)
      + deprecated      = (known after apply)
      + gateway_service = {
          + control_plane_id = (known after apply)
          + id               = (known after apply)
          + runtime_group_id = (known after apply)
        }
      + id              = (known after apply)
      + name            = "v1"
      + portals         = (known after apply)
      + updated_at      = (known after apply)
    }

  # module.default-dev-portal.konnect_application_auth_strategy.keyauth will be created
  + resource "konnect_application_auth_strategy" "keyauth" {
      + active         = (known after apply)
      + display_name   = (known after apply)
      + id             = (known after apply)
      + key_auth       = {
          + active        = (known after apply)
          + configs       = {
              + key_auth = {
                  + key_names = [
                      + "apikey",
                    ]
                }
            }
          + created_at    = (known after apply)
          + dcr_provider  = (known after apply)
          + display_name  = "Key authentication"
          + id            = (known after apply)
          + name          = "key-auth"
          + strategy_type = "key_auth"
          + updated_at    = (known after apply)
        }
      + name           = (known after apply)
      + openid_connect = (known after apply)
    }

  # module.default-dev-portal.konnect_application_auth_strategy.oidc will be created
  + resource "konnect_application_auth_strategy" "oidc" {
      + active         = (known after apply)
      + display_name   = (known after apply)
      + id             = (known after apply)
      + key_auth       = (known after apply)
      + name           = (known after apply)
      + openid_connect = {
          + active          = (known after apply)
          + configs         = {
              + openid_connect = {
                  + additional_properties = (known after apply)
                  + auth_methods          = [
                      + "bearer",
                    ]
                  + credential_claim      = [
                      + "preferred_username",
                    ]
                  + issuer                = "https://key.aufomm.com/auth/realms/demo/.well-known/openid-configuration"
                  + scopes                = [
                      + "openid",
                    ]
                }
            }
          + created_at      = (known after apply)
          + dcr_provider    = (known after apply)
          + dcr_provider_id = (known after apply)
          + display_name    = "Keycloak Bearer Auth"
          + id              = (known after apply)
          + name            = "keycloak-bearer"
          + strategy_type   = "openid_connect"
          + updated_at      = (known after apply)
        }
    }

  # module.kong-configs-demo.konnect_gateway_consumer.users["alex"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "alex"
    }

  # module.kong-configs-demo.konnect_gateway_consumer.users["alice"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "alice"
    }

  # module.kong-configs-demo.konnect_gateway_consumer.users["anna"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "anna"
    }

  # module.kong-configs-demo.konnect_gateway_consumer.users["bob"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "bob"
    }

  # module.kong-configs-demo.konnect_gateway_consumer.users["gary"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "gary"
    }

  # module.kong-configs-demo.konnect_gateway_consumer.users["joe"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "joe"
    }

  # module.kong-configs-demo.konnect_gateway_consumer.users["robin"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "robin"
    }

  # module.kong-configs-demo.konnect_gateway_consumer.users["tom"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "tom"
    }

  # module.kong-configs-demo.konnect_gateway_key_auth.user_apikeys["alex"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_key_auth.user_apikeys["alice"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_key_auth.user_apikeys["anna"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_key_auth.user_apikeys["bob"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_key_auth.user_apikeys["gary"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_key_auth.user_apikeys["joe"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_key_auth.user_apikeys["robin"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_key_auth.user_apikeys["tom"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_plugin_basic_auth.basic_auth will be created
  + resource "konnect_gateway_plugin_basic_auth" "basic_auth" {
      + config           = {
          + anonymous        = (known after apply)
          + hide_credentials = false
          + realm            = (known after apply)
        }
      + consumer         = (known after apply)
      + consumer_group   = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + instance_name    = (known after apply)
      + protocols        = (known after apply)
      + route            = (known after apply)
      + service          = {
          + id = (known after apply)
        }
      + tags             = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_plugin_key_auth.key_auth will be created
  + resource "konnect_gateway_plugin_key_auth" "key_auth" {
      + config           = {
          + anonymous        = (known after apply)
          + hide_credentials = false
          + key_in_body      = (known after apply)
          + key_in_header    = (known after apply)
          + key_in_query     = (known after apply)
          + key_names        = (known after apply)
          + realm            = (known after apply)
          + run_on_preflight = (known after apply)
        }
      + consumer         = (known after apply)
      + consumer_group   = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + instance_name    = (known after apply)
      + protocols        = (known after apply)
      + route            = (known after apply)
      + service          = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_plugin_request_termination.catch_all_terminate will be created
  + resource "konnect_gateway_plugin_request_termination" "catch_all_terminate" {
      + config           = {
          + body         = (known after apply)
          + content_type = (known after apply)
          + echo         = (known after apply)
          + message      = "🚧😮\u200d💨"
          + status_code  = 503
          + trigger      = (known after apply)
        }
      + consumer         = (known after apply)
      + consumer_group   = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + instance_name    = (known after apply)
      + protocols        = (known after apply)
      + route            = {
          + id = (known after apply)
        }
      + service          = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_route.catch_all will be created
  + resource "konnect_gateway_route" "catch_all" {
      + control_plane_id           = (known after apply)
      + created_at                 = (known after apply)
      + destinations               = (known after apply)
      + headers                    = (known after apply)
      + hosts                      = (known after apply)
      + https_redirect_status_code = (known after apply)
      + id                         = (known after apply)
      + methods                    = (known after apply)
      + name                       = "catch-all-route"
      + path_handling              = (known after apply)
      + paths                      = [
          + "/",
        ]
      + preserve_host              = (known after apply)
      + protocols                  = (known after apply)
      + regex_priority             = (known after apply)
      + request_buffering          = (known after apply)
      + response_buffering         = (known after apply)
      + service                    = (known after apply)
      + snis                       = (known after apply)
      + sources                    = (known after apply)
      + strip_path                 = false
      + tags                       = (known after apply)
      + updated_at                 = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_route.echo will be created
  + resource "konnect_gateway_route" "echo" {
      + control_plane_id           = (known after apply)
      + created_at                 = (known after apply)
      + destinations               = (known after apply)
      + headers                    = (known after apply)
      + hosts                      = (known after apply)
      + https_redirect_status_code = (known after apply)
      + id                         = (known after apply)
      + methods                    = [
          + "GET",
        ]
      + name                       = "echo-route"
      + path_handling              = (known after apply)
      + paths                      = [
          + "/echo",
        ]
      + preserve_host              = (known after apply)
      + protocols                  = (known after apply)
      + regex_priority             = (known after apply)
      + request_buffering          = (known after apply)
      + response_buffering         = (known after apply)
      + service                    = {
          + id = (known after apply)
        }
      + snis                       = (known after apply)
      + sources                    = (known after apply)
      + strip_path                 = false
      + tags                       = (known after apply)
      + updated_at                 = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_route.httpbin will be created
  + resource "konnect_gateway_route" "httpbin" {
      + control_plane_id           = (known after apply)
      + created_at                 = (known after apply)
      + destinations               = (known after apply)
      + headers                    = (known after apply)
      + hosts                      = (known after apply)
      + https_redirect_status_code = (known after apply)
      + id                         = (known after apply)
      + methods                    = [
          + "GET",
        ]
      + name                       = "httpbin-route"
      + path_handling              = (known after apply)
      + paths                      = [
          + "/bin",
        ]
      + preserve_host              = (known after apply)
      + protocols                  = (known after apply)
      + regex_priority             = (known after apply)
      + request_buffering          = (known after apply)
      + response_buffering         = (known after apply)
      + service                    = {
          + id = (known after apply)
        }
      + snis                       = (known after apply)
      + sources                    = (known after apply)
      + strip_path                 = false
      + tags                       = (known after apply)
      + updated_at                 = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_service.echo will be created
  + resource "konnect_gateway_service" "echo" {
      + ca_certificates    = (known after apply)
      + client_certificate = (known after apply)
      + connect_timeout    = (known after apply)
      + control_plane_id   = (known after apply)
      + created_at         = (known after apply)
      + enabled            = (known after apply)
      + host               = "echo"
      + id                 = (known after apply)
      + name               = "echo-svc"
      + path               = "/"
      + port               = 8080
      + protocol           = "http"
      + read_timeout       = (known after apply)
      + retries            = (known after apply)
      + tags               = (known after apply)
      + tls_verify         = (known after apply)
      + tls_verify_depth   = (known after apply)
      + updated_at         = (known after apply)
      + write_timeout      = (known after apply)
    }

  # module.kong-configs-demo.konnect_gateway_service.httpbin will be created
  + resource "konnect_gateway_service" "httpbin" {
      + ca_certificates    = (known after apply)
      + client_certificate = (known after apply)
      + connect_timeout    = (known after apply)
      + control_plane_id   = (known after apply)
      + created_at         = (known after apply)
      + enabled            = (known after apply)
      + host               = "httpbin"
      + id                 = (known after apply)
      + name               = "httpbin-svc"
      + path               = "/"
      + port               = 8080
      + protocol           = "http"
      + read_timeout       = (known after apply)
      + retries            = (known after apply)
      + tags               = (known after apply)
      + tls_verify         = (known after apply)
      + tls_verify_depth   = (known after apply)
      + updated_at         = (known after apply)
      + write_timeout      = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["alex"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "alex"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["alice"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "alice"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["anna"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "anna"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["bob"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "bob"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["gary"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "gary"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["joe"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "joe"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["robin"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "robin"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["tom"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "tom"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["alex"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["alice"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["anna"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["bob"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["gary"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["joe"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["robin"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["tom"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_plugin_key_auth.key_auth will be created
  + resource "konnect_gateway_plugin_key_auth" "key_auth" {
      + config           = {
          + anonymous        = (known after apply)
          + hide_credentials = false
          + key_in_body      = (known after apply)
          + key_in_header    = (known after apply)
          + key_in_query     = (known after apply)
          + key_names        = (known after apply)
          + realm            = (known after apply)
          + run_on_preflight = (known after apply)
        }
      + consumer         = (known after apply)
      + consumer_group   = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + instance_name    = (known after apply)
      + protocols        = (known after apply)
      + route            = (known after apply)
      + service          = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_plugin_request_termination.catch_all_terminate will be created
  + resource "konnect_gateway_plugin_request_termination" "catch_all_terminate" {
      + config           = {
          + body         = (known after apply)
          + content_type = (known after apply)
          + echo         = (known after apply)
          + message      = "🚧😮\u200d💨"
          + status_code  = 503
          + trigger      = (known after apply)
        }
      + consumer         = (known after apply)
      + consumer_group   = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + instance_name    = (known after apply)
      + protocols        = (known after apply)
      + route            = {
          + id = (known after apply)
        }
      + service          = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_route.catch_all will be created
  + resource "konnect_gateway_route" "catch_all" {
      + control_plane_id           = (known after apply)
      + created_at                 = (known after apply)
      + destinations               = (known after apply)
      + headers                    = (known after apply)
      + hosts                      = (known after apply)
      + https_redirect_status_code = (known after apply)
      + id                         = (known after apply)
      + methods                    = (known after apply)
      + name                       = "catch-all-route"
      + path_handling              = (known after apply)
      + paths                      = [
          + "/",
        ]
      + preserve_host              = (known after apply)
      + protocols                  = (known after apply)
      + regex_priority             = (known after apply)
      + request_buffering          = (known after apply)
      + response_buffering         = (known after apply)
      + service                    = (known after apply)
      + snis                       = (known after apply)
      + sources                    = (known after apply)
      + strip_path                 = false
      + tags                       = (known after apply)
      + updated_at                 = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_route.echo will be created
  + resource "konnect_gateway_route" "echo" {
      + control_plane_id           = (known after apply)
      + created_at                 = (known after apply)
      + destinations               = (known after apply)
      + headers                    = (known after apply)
      + hosts                      = (known after apply)
      + https_redirect_status_code = (known after apply)
      + id                         = (known after apply)
      + methods                    = [
          + "GET",
        ]
      + name                       = "echo-route"
      + path_handling              = (known after apply)
      + paths                      = [
          + "/echo",
        ]
      + preserve_host              = (known after apply)
      + protocols                  = (known after apply)
      + regex_priority             = (known after apply)
      + request_buffering          = (known after apply)
      + response_buffering         = (known after apply)
      + service                    = {
          + id = (known after apply)
        }
      + snis                       = (known after apply)
      + sources                    = (known after apply)
      + strip_path                 = false
      + tags                       = (known after apply)
      + updated_at                 = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_route.httpbin will be created
  + resource "konnect_gateway_route" "httpbin" {
      + control_plane_id           = (known after apply)
      + created_at                 = (known after apply)
      + destinations               = (known after apply)
      + headers                    = (known after apply)
      + hosts                      = (known after apply)
      + https_redirect_status_code = (known after apply)
      + id                         = (known after apply)
      + methods                    = [
          + "GET",
        ]
      + name                       = "httpbin-route"
      + path_handling              = (known after apply)
      + paths                      = [
          + "/bin",
        ]
      + preserve_host              = (known after apply)
      + protocols                  = (known after apply)
      + regex_priority             = (known after apply)
      + request_buffering          = (known after apply)
      + response_buffering         = (known after apply)
      + service                    = {
          + id = (known after apply)
        }
      + snis                       = (known after apply)
      + sources                    = (known after apply)
      + strip_path                 = true
      + tags                       = (known after apply)
      + updated_at                 = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_service.echo will be created
  + resource "konnect_gateway_service" "echo" {
      + ca_certificates    = (known after apply)
      + client_certificate = (known after apply)
      + connect_timeout    = (known after apply)
      + control_plane_id   = (known after apply)
      + created_at         = (known after apply)
      + enabled            = (known after apply)
      + host               = "ip-168-186-31-166.ap-southeast-2.compute.internal"
      + id                 = (known after apply)
      + name               = "echo-svc"
      + path               = "/"
      + port               = 8080
      + protocol           = "http"
      + read_timeout       = (known after apply)
      + retries            = (known after apply)
      + tags               = (known after apply)
      + tls_verify         = (known after apply)
      + tls_verify_depth   = (known after apply)
      + updated_at         = (known after apply)
      + write_timeout      = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_service.httpbin will be created
  + resource "konnect_gateway_service" "httpbin" {
      + ca_certificates    = (known after apply)
      + client_certificate = (known after apply)
      + connect_timeout    = (known after apply)
      + control_plane_id   = (known after apply)
      + created_at         = (known after apply)
      + enabled            = (known after apply)
      + host               = "httpbin.org"
      + id                 = (known after apply)
      + name               = "httpbin-svc"
      + path               = "/"
      + port               = 443
      + protocol           = "https"
      + read_timeout       = (known after apply)
      + retries            = (known after apply)
      + tags               = (known after apply)
      + tls_verify         = (known after apply)
      + tls_verify_depth   = (known after apply)
      + updated_at         = (known after apply)
      + write_timeout      = (known after apply)
    }

  # module.networks["dev_au"].konnect_cloud_gateway_network.cgw_network will be created
  + resource "konnect_cloud_gateway_network" "cgw_network" {
      + availability_zones                = [
          + "apse2-az1",
          + "apse2-az2",
          + "apse2-az3",
        ]
      + cidr_block                        = "10.10.0.0/16"
      + cloud_gateway_provider_account_id = "e7d54ffb-7bfc-442d-837f-d7cbe9920e4a"
      + configuration_reference_count     = (known after apply)
      + created_at                        = (known after apply)
      + ddos_protection                   = false
      + default                           = (known after apply)
      + entity_version                    = (known after apply)
      + firewall                          = {
          + allowed_cidr_blocks = [
              + "0.0.0.0/0",
            ]
          + denied_cidr_blocks  = (known after apply)
        }
      + id                                = (known after apply)
      + name                              = "dev_au"
      + provider_metadata                 = (known after apply)
      + region                            = "ap-southeast-2"
      + state                             = (known after apply)
      + transit_gateway_count             = (known after apply)
      + updated_at                        = (known after apply)
    }

Plan: 1 to import, 62 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + cloud_gateway_edge_urls = {}
  + gateway_cps_endpoints   = {
      + demo         = (known after apply)
      + home_cluster = (known after apply)
      + staging      = (known after apply)
    }
  + network_ids             = {
      + dev_au = {
          + id = (known after apply)
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @liyangau, Action: `pull_request`*